In [3]:
import pandas as pd
df = pd.read_csv('../../DataSets/employees.csv',parse_dates=["Start Date","Last Login Time"])
df["Gender"] = df['Gender'].astype("category")
df["Senior Management"] = df['Senior Management'].astype("bool")

mask = df['Salary'].between(left=60000,right=70000)
df[mask]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2019-10-16 06:53:00,61933,4.170,True,NaN
6,Ruby,Female,1987-08-17,2019-10-16 16:20:00,65476,10.012,True,Product
10,Louise,Female,1980-08-12,2019-10-16 09:01:00,63241,15.132,True,NaN
20,Lois,NaN,1995-04-22,2019-10-16 19:18:00,64714,4.934,True,Legal
41,Christine,NaN,2015-06-28,2019-10-16 01:08:00,66582,11.308,True,Business Development
...,...,...,...,...,...,...,...,...
965,Catherine,Female,1989-09-25,2019-10-16 01:31:00,68164,18.393,False,Client Services
970,Alice,Female,1988-09-03,2019-10-16 20:54:00,63571,15.397,True,Product
974,Harry,Male,2011-08-30,2019-10-16 18:31:00,67656,16.455,True,Client Services
978,Sean,Male,1983-01-17,2019-10-16 14:23:00,66146,11.178,False,Human Resources
998,Larry,Male,2013-04-20,2019-10-16 16:45:00,60500,11.985,False,Business Development

In [7]:
# Between methods also works on datetime datatypes

mask = df['Start Date'].between('1991-01-01','1992-01-01')
df[mask]

mask1 = df['Last Login Time'].between('8:30AM','12:00PM')
df[mask1]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2019-10-16 11:17:00,130590,11.858,False,Finance
7,NaN,Female,2015-07-20,2019-10-16 10:43:00,45906,11.598,True,Finance
10,Louise,Female,1980-08-12,2019-10-16 09:01:00,63241,15.132,True,NaN
18,Diana,Female,1981-10-23,2019-10-16 10:27:00,132940,19.082,False,Client Services
33,Jean,Female,1993-12-18,2019-10-16 09:07:00,119082,16.180,False,Business Development
...,...,...,...,...,...,...,...,...
963,Ann,Female,1994-09-23,2019-10-16 11:15:00,89443,17.940,True,Sales
977,Sarah,Female,1995-12-04,2019-10-16 09:16:00,124566,5.949,False,Product
982,Rose,Female,1982-04-06,2019-10-16 10:43:00,91411,8.639,True,Human Resources
988,Alice,Female,2004-10-05,2019-10-16 09:34:00,47638,11.209,False,Human Resources
992,Anthony,Male,2011-10-16,2019-10-16 08:35:00,112769,11.625,True,Finance